wolffam/PSoC6_IMU/FunctionalityTesting.cydsn/codegentemp/I2C_bus.h
/***************************************************************************//**
* \file I2C_bus.c
* \version 2.0
*
*  This file provides constants and parameter values for the I2C component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(I2C_bus_CY_SCB_I2C_PDL_H)
#define I2C_bus_CY_SCB_I2C_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_i2c.h"

#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*   Initial Parameter Constants
****************************************/

#define I2C_bus_MODE               (0x2U)
#define I2C_bus_MODE_SLAVE_MASK    (0x1U)
#define I2C_bus_MODE_MASTER_MASK   (0x2U)

#define I2C_bus_ENABLE_SLAVE       (0UL != (I2C_bus_MODE & I2C_bus_MODE_SLAVE_MASK))
#define I2C_bus_ENABLE_MASTER      (0UL != (I2C_bus_MODE & I2C_bus_MODE_MASTER_MASK))
#define I2C_bus_MANUAL_SCL_CONTROL (0U)


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component only APIs. */
void I2C_bus_Start(void);

/* Basic functions. */
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_Init(cy_stc_scb_i2c_config_t const *config);
__STATIC_INLINE void I2C_bus_DeInit (void);
__STATIC_INLINE void I2C_bus_Enable (void);
__STATIC_INLINE void I2C_bus_Disable(void);

/* Data rate configuration functions. */
__STATIC_INLINE uint32_t I2C_bus_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz);
__STATIC_INLINE uint32_t I2C_bus_GetDataRate(uint32_t scbClockHz);

/* Register callbacks. */
__STATIC_INLINE void I2C_bus_RegisterEventCallback(cy_cb_scb_i2c_handle_events_t callback);
#if (I2C_bus_ENABLE_SLAVE)
__STATIC_INLINE void I2C_bus_RegisterAddrCallback (cy_cb_scb_i2c_handle_addr_t callback);
#endif /* (I2C_bus_ENABLE_SLAVE) */

/* Configuration functions. */
#if (I2C_bus_ENABLE_SLAVE)
__STATIC_INLINE void     I2C_bus_SlaveSetAddress(uint8_t addr);
__STATIC_INLINE uint32_t I2C_bus_SlaveGetAddress(void);
__STATIC_INLINE void     I2C_bus_SlaveSetAddressMask(uint8_t addrMask);
__STATIC_INLINE uint32_t I2C_bus_SlaveGetAddressMask(void);
#endif /* (I2C_bus_ENABLE_SLAVE) */

#if (I2C_bus_ENABLE_MASTER)
__STATIC_INLINE void I2C_bus_MasterSetLowPhaseDutyCycle (uint32_t clockCycles);
__STATIC_INLINE void I2C_bus_MasterSetHighPhaseDutyCycle(uint32_t clockCycles);
#endif /* (I2C_bus_ENABLE_MASTER) */

/* Bus status. */
__STATIC_INLINE bool     I2C_bus_IsBusBusy(void);

/* Slave functions. */
#if (I2C_bus_ENABLE_SLAVE)
__STATIC_INLINE uint32_t I2C_bus_SlaveGetStatus(void);

__STATIC_INLINE void     I2C_bus_SlaveConfigReadBuf(uint8_t *buffer, uint32_t size);
__STATIC_INLINE void     I2C_bus_SlaveAbortRead(void);
__STATIC_INLINE uint32_t I2C_bus_SlaveGetReadTransferCount(void);
__STATIC_INLINE uint32_t I2C_bus_SlaveClearReadStatus(void);

__STATIC_INLINE void     I2C_bus_SlaveConfigWriteBuf(uint8_t *buffer, uint32_t size);
__STATIC_INLINE void     I2C_bus_SlaveAbortWrite(void);
__STATIC_INLINE uint32_t I2C_bus_SlaveGetWriteTransferCount(void);
__STATIC_INLINE uint32_t I2C_bus_SlaveClearWriteStatus(void);
#endif /* (I2C_bus_ENABLE_SLAVE) */

/* Master interrupt processing functions. */
#if (I2C_bus_ENABLE_MASTER)
__STATIC_INLINE uint32_t I2C_bus_MasterGetStatus(void);

__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterRead(cy_stc_scb_i2c_master_xfer_config_t *xferConfig);
__STATIC_INLINE void I2C_bus_MasterAbortRead(void);
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterWrite(cy_stc_scb_i2c_master_xfer_config_t *xferConfig);
__STATIC_INLINE void I2C_bus_MasterAbortWrite(void);
__STATIC_INLINE uint32_t I2C_bus_MasterGetTransferCount(void);

/* Master manual processing functions. */
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterSendStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterSendReStart(uint32_t address, cy_en_scb_i2c_direction_t bitRnW, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterSendStop(uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterReadByte(cy_en_scb_i2c_command_t ackNack, uint8_t *byte, uint32_t timeoutMs);
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterWriteByte(uint8_t byte, uint32_t timeoutMs);
#endif /* (I2C_bus_ENABLE_MASTER) */

/* Interrupt handler. */
__STATIC_INLINE void I2C_bus_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8_t I2C_bus_initVar;
extern cy_stc_scb_i2c_config_t const I2C_bus_config;
extern cy_stc_scb_i2c_context_t I2C_bus_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the SCB instance */
#define I2C_bus_HW     ((CySCB_Type *) I2C_bus_SCB__HW)

/** The desired data rate in Hz */
#define I2C_bus_DATA_RATE_HZ      (100000U)

/** The frequency of the clock used by the Component in Hz */
#define I2C_bus_CLK_FREQ_HZ       (1562500U)

/** The number of Component clocks used by the master to generate the SCL
* low phase. This number is calculated by GUI based on the selected data rate.
*/
#define I2C_bus_LOW_PHASE_DUTY_CYCLE   (8U)

/** The number of Component clocks used by the master to generate the SCL
* high phase. This number is calculated by GUI based on the selected data rate.
*/
#define I2C_bus_HIGH_PHASE_DUTY_CYCLE  (8U)
/** @} group_macros */


