wolffam/PSoC6_IMU/FunctionalityTesting.cydsn/codegentemp/I2C_bus.h
/*******************************************************************************
* Function Name: I2C_bus_MasterSetHighPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetHighPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_bus_MasterSetHighPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(I2C_bus_HW, clockCycles);
}
#endif /* (I2C_bus_ENABLE_MASTER) */


#if (I2C_bus_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_bus_SlaveGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_SlaveGetStatus(void)
{
    return Cy_SCB_I2C_SlaveGetStatus(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveConfigReadBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigReadBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_bus_SlaveConfigReadBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigReadBuf(I2C_bus_HW, buffer, size, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveAbortRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortRead() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_bus_SlaveAbortRead(void)
{
    Cy_SCB_I2C_SlaveAbortRead(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveGetReadTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetReadTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_SlaveGetReadTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetReadTransferCount(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveClearReadStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearReadStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_SlaveClearReadStatus(void)
{
    return Cy_SCB_I2C_SlaveClearReadStatus(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveConfigWriteBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigWriteBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_bus_SlaveConfigWriteBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigWriteBuf(I2C_bus_HW, buffer, size, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveAbortWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_bus_SlaveAbortWrite(void)
{
    Cy_SCB_I2C_SlaveAbortWrite(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveGetWriteTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetWriteTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_SlaveGetWriteTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetWriteTransferCount(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_SlaveClearWriteStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearWriteStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_SlaveClearWriteStatus(void)
{
    return Cy_SCB_I2C_SlaveClearWriteStatus(I2C_bus_HW, &I2C_bus_context);
}
#endif /* (I2C_bus_ENABLE_SLAVE) */


#if (I2C_bus_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_bus_MasterGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_bus_MasterGetStatus(void)
{
    return Cy_SCB_I2C_MasterGetStatus(I2C_bus_HW, &I2C_bus_context);
}


/*******************************************************************************
* Function Name: I2C_bus_MasterRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterRead() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_bus_MasterRead(cy_stc_scb_i2c_master_xfer_config_t *xferConfig)
{
    return Cy_SCB_I2C_MasterRead(I2C_bus_HW, xferConfig, &I2C_bus_context);
}


